{"data":{"post":{"id":"55f5f531-4fd4-55d3-9398-ce3b7b432432","html":"<p>With just three days left to work in the lab before Super Regionals we are very hopeful about our ability to succeed at the upcoming competition and hopefully make it to Worlds for the first time! Since the NYC regional, we have worked to improve our robot’s autonomous, fixed many of our robot’s faulty mechanisms, and worked to prepare for judges meet and scout out the teams we’re facing at competition this coming weekend.</p>\n<p>At the NYC Regional our code for autonomous period had many bugs which resulted in our robot spinning in circles and failing to push over any of the jewels (much less the right one!). We have fixed the turn algorithm so that the robot turns in the closer direction every time, and reversed the jewel arm extension so that it hits the jewels outwards onto the field, instead of into the field wall.</p>\n<p>In terms of our robot’s hardware we have also made many improvements. Our flipping ramp has been replaced from a lexan ramp which didn’t have walls to an aluminum ramp with edges that allow for much more accurate placement of the glyphs. We also improved the lift for the mechanism by adding washers to prevent the string from becoming caught. Additionally, we have fine-tuned our relic mechanism so that we can prevent it from becoming unstrung and hopefully achieve a double relic within 45 seconds. Our final major change to our robot over the past few weeks has been to modify our acquirer in two major ways. First, we switched the side that the acquirer was attached to so as to prevent it from interfering with the relic mechanism. Secondly, we changed the wheeled intake from using a combination of small and large stealth wheels to using four 4” compliant wheels which we believe do a much better job of acquiring glyphs. We suspect that with these changes we will be able to acquire and deposit 8-10 glyphs during the course of teleop.</p>\n<p>We have also extensively worked to prep the team for competition. We have scouted out the abilities of many of the teams going to supers through posts on YouTube, FIRST website, team’s social media accounts, and team websites. Further, we have prepared our team for Judge’s meet by holding tryouts and run-throughs.</p>\n<p>We’re very excited to meet new teams and see how other teams have approached this year’s challenge, and we’re very grateful to our mentors and sponsors for this opportunity! Tell us what your team has been doing to prepare for supers or how you’ve been spending the off season!</p>\n<img src=\"htps://imgur.com/R26kksh.jpg\" alt=\"stringing system\" width=\"100%\">","fields":{"slug":"/preparations/","prefix":"2018-03-12"},"frontmatter":{"title":"Preparing for Supers","author":"Max Lobel","category":"Competition","cover":{"childImageSharp":{"resize":{"src":"/static/3678ff00f698c4207fafdd01291401ac/ada8c/preparations.jpg"}}}}},"authornote":{"id":"8c15c038-9c22-5cf2-abae-8ea0e97c0c4f","html":"<p><strong>Stuy Fission 310</strong> Stuy Fission is an FTC team based at Stuyvesant High School, New York. We strive to have fun helping the community, learning, and competing, while always following the maxim of gracious professionalism.</p>"},"site":{"siteMetadata":{"facebook":{"appId":""}}}},"pageContext":{"slug":"/preparations/","prev":{"id":"c51cea4b-5f37-50d0-bd42-a3d70f704c65","fields":{"slug":"/310day/","prefix":"2018-03-10","source":"posts"},"frontmatter":{"title":"310 Day","category":"Update"}},"next":{"id":"f1e43f89-a6f3-58c9-b228-e2626302b79b","fields":{"slug":"/fll-champs/","prefix":"2018-03-12","source":"posts"},"frontmatter":{"title":"Volunteering at NYC FLL Championship","category":"Out Reach"}},"source":"posts"}}