{"data":{"post":{"id":"3e8778e8-5dc5-5bec-b5d3-4be8f65e51f5","html":"<img src=\"https://imgur.com/eHY97fL.jpg\" alt=\"Saahir&apos;s presentation\" width=\"100%\">\n<p>On October 8th, the CEPC  planned and hosted FTC Splash. Both our Head of Engineering and our Head of Software Engineering gave lectures during the event. It was an amazing time and we had a great time learning from and teaching other FTC teams.</p>\n<p>The day started off with some brief icebreakers and afterwards we got straight into the lectures about CADing and a combination of Intro to Java and CV from our two heads (Engineering and Software). They did an amazing job, being the first ones, and set the tone for the day. Many teams attend both to learn more about important processes of building and coding a robot.</p>\n<p>Many of the other lectures were also given by students, two of them coming from our sister team, Fusion 479. We attended lectures all day, splitting up so that we could hear more lectures. This was an enriching experience because even though we are a well established team, there is always more for us to learn.\nDuring the day, members also attended the Women in STEM lecture in which there was a brief presentation and a open floor type of discussion. We learned about many more girls and their struggles and triumphs in STEM and more specifically FTC.</p>\n<p>There was another team whose story we heard. The girls were from Nightingale, an all girls school. Most of the bias they faced wasn’t coming from being female, but mostly from being females interested in STEM in a humanities school. We realized how fortunate we were to be in a team and school that supported us and our female members. After the lecture, we talked more with the Nightingale team and decided that we had the resources and time to help and mentor them. Ever since, we have stayed in contact with them and are looking forward to working with them in the near future! Check out our <a href=\"https://www.instagram.com/stuyfission/?hl=en\">Instagram</a> for more updates!</p>\n<img src=\"https://imgur.com/F0ZTARz.jpg\" alt=\"FTC splash group picture\" width=\"100%\">","fields":{"slug":"/FTCSplash/","prefix":"2018-10-15"},"frontmatter":{"title":"FTC Splash","author":"Megan Gupta-She","category":"Out Reach","cover":{"childImageSharp":{"resize":{"src":"/static/4377884b264dfa797a38bfb455732b57/ada8c/splash.jpg"}}}}},"authornote":{"id":"8c15c038-9c22-5cf2-abae-8ea0e97c0c4f","html":"<p><strong>Stuy Fission 310</strong> Stuy Fission is an FTC team based at Stuyvesant High School, New York. We strive to have fun helping the community, learning, and competing, while always following the maxim of gracious professionalism.</p>"},"site":{"siteMetadata":{"facebook":{"appId":"..."}}}},"pageContext":{"slug":"/FTCSplash/","prev":{"id":"0efb75ac-41c8-535b-afe5-d4bba11aa68d","fields":{"slug":"/kickoff+newbies/","prefix":"2018-09-10","source":"posts"},"frontmatter":{"title":"Kickoff + Newbies","category":"Update"}},"source":"posts"}}