{"data":{"post":{"id":"97cbb218-ee37-58fb-960b-bea4f2753ea6","html":"<p>Yesterday, our team was very fortunate to compete at the NYC Regional Championship at Townsend Harris High School.  Despite facing tremendous technical difficulties with almost every part of our robot we were nominated for the Connect and Think award, and we were able to win the PTC Design Award and the 3rd place Inspire Award. By winning the 3rd place Inspire Award, we advanced to the East Super-Regional competition in Scranton, Pennsylvania from March 16-18th!</p>\n<p>During the qualification matches, many of our robot’s components failed to function properly, and we were thus unable to win any of our five matches.  In our first match, we did not properly secure some wires and the battery, and we disconnected early on in the match.  In our other matches, we faced difficulties with keeping our glyph intake chain aligned, preventing glyphs from getting stuck in the middle of our robot, and preventing the strings and wiring in the relic mechanism from jamming.  In addition, our autonomous routine faced issues with aligning with the cryptobox to score and scoring the jewel.</p>\n<p>We cannot thank our mentors and advisors enough for supporting us throughout the weeks leading up to this regional competition.  Our coaches Mr. Blay and Mr. Lonardo worked tirelessly to help us build our robot: volunteering their midwinter break to schedule and supervise meetings at our school throughout this time, helping us coordinate our trip to Townsend Harris, and even bringing our robot and spare parts to competition for us. We would not have been able to win these awards without our mentors’ help. Additionally, we would like to thank the efforts of the many volunteers who made this competition a resounding success!</p>\n<p>We were very impressed with so many of the teams from the NYC regional and offer our congratulations to all that advance. We are super excited to be continuing to Super Regionals and we look forward to competing with the teams from across the Northeast!</p>\n<img src=\"https://imgur.com/3x007Pt.jpg\" alt=\"team picture\" width=\"100%\">","fields":{"slug":"/regionals/","prefix":"2018-02-26"},"frontmatter":{"title":"NYC Regional Championship","author":"Saahir Ganti-Agarwal and Max Lobel","category":"Competition","cover":{"childImageSharp":{"resize":{"src":"/Fission310/static/b99264502de594f7cd49357edc7d63d5/ada8c/FrannyWin.jpg"}}}}},"authornote":{"id":"ed12eb76-f3aa-5abb-888e-01033540e2b9","html":"<p><strong>Stuy Fission 310</strong> Stuy Fission is an FTC team based at Stuyvesant High School, New York. We strive to have fun helping the community, learning, and competing, while always following the maxim of gracious professionalism.</p>"},"site":{"siteMetadata":{"facebook":{"appId":"..."}}}},"pageContext":{"slug":"/regionals/","prev":{"id":"1a89ff5a-1bce-5596-a789-e55fa3095450","fields":{"slug":"/welcome/","prefix":"2018-01-31","source":"posts"},"frontmatter":{"title":"Welcome - The Start of Something New","category":"Update"}},"next":{"id":"0c01bcf5-9897-55f5-bfb4-c1785db70fea","fields":{"slug":"/310day/","prefix":"2018-03-10","source":"posts"},"frontmatter":{"title":"310 Day","category":"Update"}},"source":"posts"}}