{"data":{"post":{"id":"909a8b03-c2eb-5a15-8894-d76377c5947e","html":"<img src=\"https://imgur.com/5rU4RRg.jpg\" alt=\"fll team\" width=\"100%\">\n<p>This past Sunday was the NYC FLL Championship. Several members of our team are heavily involved with FLL - both through mentoring and volunteering for events. As such, we were very excited to volunteer for the Championship. In combination with our sister team (FRC StuyPulse 694) and our school’s Honor Society, we were referees, mentors, queuers and judges. Although volunteering was difficult and tiring, especially with 63(!) teams present, 24 judging rooms and 2 different buildings, the enthusiasm of the FLL teams was infectious. Queuing allowed me the opportunity to interact with teams as I brought them to their judging rooms. In these short trips, I had the opportunity to talk to these students about their projects and robots. As I learned about the various solutions these elementary and middle schoolers came up with, I was seriously impressed by the level of knowledge and maturity that these students show.</p>\n<p>We were also impressed by the robots of the teams we mentor. Team 5355 reached rank 4 with a high score of 160! Although 5893, 9577, 28864, 2562, and the 11841 did not place in the top ten, we were amazed by the sophistication of their bots as well as all they learned in the building process. We are looking forward to watching these teams grow in coming years!</p>","fields":{"slug":"/fll-champs/","prefix":"2018-03-12"},"frontmatter":{"title":"Volunteering at NYC FLL Championship","author":"Jessica Tao","category":"Out Reach","cover":{"childImageSharp":{"resize":{"src":"/static/f7206e770fe8aa6e84ba1435b026e189/ada8c/FLLTour.jpg"}}}}},"authornote":{"id":"ed12eb76-f3aa-5abb-888e-01033540e2b9","html":"<p><strong>Stuy Fission 310</strong> Stuy Fission is an FTC team based at Stuyvesant High School, New York. We strive to have fun helping the community, learning, and competing, while always following the maxim of gracious professionalism.</p>"},"site":{"siteMetadata":{"facebook":{"appId":"..."}}}},"pageContext":{"slug":"/fll-champs/","prev":{"id":"0c01bcf5-9897-55f5-bfb4-c1785db70fea","fields":{"slug":"/310day/","prefix":"2018-03-10","source":"posts"},"frontmatter":{"title":"310 Day","category":"Update"}},"next":{"id":"5c950324-8d52-566a-9c55-053a9afeb317","fields":{"slug":"/preparations/","prefix":"2018-03-12","source":"posts"},"frontmatter":{"title":"Preparing for Supers","category":"Competition"}},"source":"posts"}}